-- MySQL dump 10.13  Distrib 8.0.18, for Win64 (x86_64)
--
-- Host: localhost    Database: plane
-- ------------------------------------------------------
-- Server version	8.0.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin_info`
--

DROP TABLE IF EXISTS `admin_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL COMMENT '管理员账号',
  `password` varchar(50) NOT NULL COMMENT '管理员密码',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_info`
--

LOCK TABLES `admin_info` WRITE;
/*!40000 ALTER TABLE `admin_info` DISABLE KEYS */;
INSERT INTO `admin_info` VALUES (1,'admin','admin123'),(2,'operator','operator123'),(3,'temp_admin','temp123456'),(4,'read_only','readonly123'),(5,'test','123'),(6,'admin_001','Admin@123');
/*!40000 ALTER TABLE `admin_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `flight_info`
--

DROP TABLE IF EXISTS `flight_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `flight_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `flight_no` varchar(20) NOT NULL COMMENT '航班号（如MF8340）',
  `airline` varchar(50) NOT NULL COMMENT '航空公司（如厦门航空）',
  `plane_type` varchar(30) DEFAULT NULL COMMENT '机型（如空客321(中)）',
  `depart_city` varchar(20) NOT NULL COMMENT '出发城市（如广州）',
  `arrive_city` varchar(20) NOT NULL COMMENT '到达城市（如北京）',
  `depart_airport` varchar(50) DEFAULT NULL COMMENT '起飞机场（如白云国际机场T2）',
  `arrive_airport` varchar(50) DEFAULT NULL COMMENT '降飞机场（如大兴国际机场）',
  `depart_time` varchar(10) NOT NULL COMMENT '起飞时间（如21:10）',
  `arrive_time` varchar(10) NOT NULL COMMENT '降落时间（如00:10）',
  `is_next_day` tinyint(4) DEFAULT '0' COMMENT '是否+1天（0=否，1=是）',
  `price` decimal(10,2) NOT NULL COMMENT '价格（如1122.00）',
  `price_int` int(11) NOT NULL DEFAULT '0' COMMENT '价格（整数，用于排序）',
  `economy_price` int(11) NOT NULL DEFAULT '0' COMMENT '经济舱价格（元）',
  `economy_remain` int(11) NOT NULL DEFAULT '0' COMMENT '经济舱余票数量',
  `business_price` int(11) NOT NULL DEFAULT '0' COMMENT '公务舱价格（元）',
  `business_remain` int(11) NOT NULL DEFAULT '0' COMMENT '公务舱余票数量',
  `first_price` int(11) NOT NULL DEFAULT '0' COMMENT '头等舱价格（元）',
  `first_remain` int(11) NOT NULL DEFAULT '0' COMMENT '头等舱余票数量',
  `duration` int(11) NOT NULL DEFAULT '0' COMMENT '飞行时长（分钟）',
  `on_time_rate` int(11) NOT NULL DEFAULT '90' COMMENT '准点率（0-100）',
  `remain_tickets` varchar(20) DEFAULT '' COMMENT '剩余票数（如剩3张）',
  `flight_type` tinyint(4) NOT NULL COMMENT '航班类型（0=去程，1=返程）',
  `logo_path` varchar(255) DEFAULT '' COMMENT '航空公司Logo路径（如:/images/xiamen.png）',
  `has_tag` tinyint(4) DEFAULT '0' COMMENT '是否显示标签',
  `flight_date` date DEFAULT NULL COMMENT '航班日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='航班信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `flight_info`
--

LOCK TABLES `flight_info` WRITE;
/*!40000 ALTER TABLE `flight_info` DISABLE KEYS */;
INSERT INTO `flight_info` VALUES (1,'CA1301','中国国际航空','波音737','北京','上海','北京首都机场','上海浦东机场','08:00','10:30',0,850.00,850,850,43,1530,5,2975,5,150,98,'53',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(2,'CA1302','中国国际航空','空客A320','北京','上海','北京首都机场','上海浦东机场','10:00','12:40',0,920.00,920,920,17,1656,2,3220,1,160,97,'20',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(3,'CA1501','中国国际航空','空客A330','北京','广州','北京首都机场','广州白云机场','09:15','11:45',0,1050.00,1050,1050,34,1890,5,3675,1,150,96,'40',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(4,'CA1502','中国国际航空','波音787','北京','广州','北京首都机场','广州白云机场','14:20','17:00',0,1180.00,1180,1180,17,2124,1,4130,4,160,99,'22',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(5,'CA1801','中国国际航空','空客A350','北京','深圳','北京首都机场','深圳宝安机场','11:30','15:40',0,1250.00,1250,1250,21,2250,4,4375,0,250,95,'25',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(6,'CA1802','中国国际航空','波音777','北京','深圳','北京首都机场','深圳宝安机场','16:10','20:20',0,1380.00,1380,1380,11,2484,1,4830,1,250,94,'13',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(7,'CA4101','中国国际航空','空客A321','北京','成都','北京首都机场','成都天府机场','07:40','10:10',0,980.00,980,980,10,1764,4,3430,4,150,97,'18',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(8,'CA4102','中国国际航空','波音737','北京','成都','北京首都机场','成都天府机场','13:00','15:30',0,1050.00,1050,1050,40,1890,5,3675,0,150,96,'45',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(9,'CA981','中国国际航空','波音747','北京','上海','北京首都机场','上海虹桥机场','15:00','18:30',0,880.00,880,880,22,1584,2,3080,3,210,98,'27',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(10,'CA982','中国国际航空','空客A330','北京','上海','北京首都机场','上海虹桥机场','19:00','22:30',0,950.00,950,950,35,1710,5,3325,0,210,97,'40',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(11,'MU5101','东方航空','空客A320','上海','北京','上海浦东机场','北京首都机场','08:30','11:00',0,820.00,820,820,30,1476,2,2870,0,150,95,'32',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(12,'MU5102','东方航空','波音737','上海','北京','上海浦东机场','北京首都机场','10:40','13:10',0,890.00,890,890,24,1602,3,3115,2,150,96,'29',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(13,'MU5301','东方航空','空客A330','上海','广州','上海浦东机场','广州白云机场','09:20','12:00',0,980.00,980,980,17,1764,7,3430,4,160,94,'28',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(14,'MU5302','东方航空','波音787','上海','广州','上海浦东机场','广州白云机场','14:10','16:50',0,1050.00,1050,1050,42,1890,8,3675,2,160,95,'52',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(15,'MU5401','东方航空','空客A350','上海','深圳','上海浦东机场','深圳宝安机场','11:10','14:30',0,1120.00,1120,1120,35,2016,1,3920,1,200,93,'37',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(16,'MU5402','东方航空','波音777','上海','深圳','上海浦东机场','深圳宝安机场','15:40','19:00',0,1200.00,1200,1200,42,2160,6,4200,1,200,94,'49',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(17,'MU5601','东方航空','空客A321','上海','成都','上海浦东机场','成都天府机场','07:20','10:50',0,1080.00,1080,1080,36,1944,6,3780,3,210,96,'45',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(18,'MU5602','东方航空','波音737','上海','成都','上海浦东机场','成都天府机场','12:30','16:00',0,1150.00,1150,1150,37,2070,5,4025,2,210,97,'44',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(19,'MU2801','东方航空','空客A330','南京','北京','南京禄口机场','北京首都机场','08:50','11:20',0,780.00,780,780,24,1404,8,2730,2,150,95,'34',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(20,'MU2802','东方航空','波音737','南京','北京','南京禄口机场','北京首都机场','13:40','16:10',0,850.00,850,850,18,1530,7,2975,4,150,96,'29',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(21,'CZ3101','南方航空','空客A320','广州','北京','广州白云机场','北京首都机场','09:00','11:40',0,950.00,950,950,48,1710,5,3325,0,160,97,'53',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(22,'CZ3102','南方航空','波音737','广州','北京','广州白云机场','北京首都机场','11:30','14:10',0,1020.00,1020,1020,27,1836,9,3570,5,160,98,'41',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(23,'CZ3201','南方航空','空客A330','广州','上海','广州白云机场','上海浦东机场','08:10','10:40',0,880.00,880,880,39,1584,2,3080,3,150,96,'44',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(24,'CZ3202','南方航空','波音787','广州','上海','广州白云机场','上海浦东机场','12:20','14:50',0,950.00,950,950,29,1710,7,3325,5,150,97,'41',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(25,'CZ3301','南方航空','空客A350','广州','深圳','广州白云机场','深圳宝安机场','10:00','13:20',0,650.00,650,650,32,1170,1,2275,2,140,99,'35',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(26,'CZ3302','南方航空','波音777','广州','深圳','广州白云机场','深圳宝安机场','15:10','18:30',0,720.00,720,720,40,1296,8,2520,3,140,98,'51',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(27,'CZ3401','南方航空','空客A321','广州','成都','广州白云机场','成都天府机场','07:30','11:00',0,1100.00,1100,1100,28,1980,7,3850,0,210,95,'35',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(28,'CZ3402','南方航空','波音737','广州','成都','广州白云机场','成都天府机场','13:00','16:30',0,1180.00,1180,1180,11,2124,1,4130,2,210,96,'14',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(29,'CZ6101','南方航空','空客A330','沈阳','北京','沈阳桃仙机场','北京首都机场','08:40','11:10',0,680.00,680,680,31,1224,6,2380,1,150,94,'38',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(30,'CZ6102','南方航空','波音737','沈阳','北京','沈阳桃仙机场','北京首都机场','14:20','16:50',0,750.00,750,750,28,1350,7,2625,4,150,95,'39',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(31,'HU7101','海南航空','波音787','海口','北京','海口美兰机场','北京首都机场','09:30','12:00',0,1200.00,1200,1200,14,2160,2,4200,3,150,97,'19',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(32,'HU7102','海南航空','空客A330','海口','北京','海口美兰机场','北京首都机场','13:40','16:10',0,1280.00,1280,1280,11,2304,7,4480,0,150,98,'18',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(33,'HU7201','海南航空','空客A350','三亚','北京','三亚凤凰机场','北京首都机场','08:20','11:50',0,1350.00,1350,1350,28,2430,1,4725,0,210,96,'29',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(34,'HU7202','海南航空','波音777','三亚','北京','三亚凤凰机场','北京首都机场','14:00','17:30',0,1420.00,1420,1420,12,2556,1,4970,1,210,97,'14',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(35,'HU7301','海南航空','空客A320','海口','广州','海口美兰机场','广州白云机场','10:10','12:40',0,850.00,850,850,14,1530,8,2975,3,150,95,'25',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(36,'HU7302','海南航空','波音737','海口','广州','海口美兰机场','广州白云机场','15:30','18:00',0,920.00,920,920,21,1656,9,3220,3,150,96,'33',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(37,'ZH9101','深圳航空','空客A320','深圳','北京','深圳宝安机场','北京首都机场','10:20','13:50',0,1280.00,1280,1280,15,2304,1,4480,4,210,98,'20',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(38,'ZH9102','深圳航空','波音737','深圳','北京','深圳宝安机场','北京首都机场','14:40','18:10',0,1350.00,1350,1350,45,2430,1,4725,2,210,99,'48',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(39,'ZH9201','深圳航空','空客A330','深圳','上海','深圳宝安机场','上海浦东机场','09:10','11:40',0,980.00,980,980,23,1764,2,3430,5,150,97,'30',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(40,'ZH9202','深圳航空','波音787','深圳','上海','深圳宝安机场','上海浦东机场','13:20','15:50',0,1050.00,1050,1050,19,1890,3,3675,3,150,98,'25',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(41,'ZH9301','深圳航空','空客A350','深圳','广州','深圳宝安机场','广州白云机场','08:30','11:00',0,620.00,620,620,17,1116,2,2170,1,150,99,'20',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(42,'ZH9302','深圳航空','波音777','深圳','广州','深圳宝安机场','广州白云机场','12:40','15:10',0,690.00,690,690,30,1242,10,2415,1,150,98,'41',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(43,'MF8101','厦门航空','空客A320','厦门','北京','厦门高崎机场','北京首都机场','08:40','11:10',0,1180.00,1180,1180,33,2124,1,4130,2,150,96,'36',1,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-01'),(44,'MF8102','厦门航空','波音737','厦门','北京','厦门高崎机场','北京首都机场','13:20','15:50',0,1250.00,1250,1250,40,2250,8,4375,2,150,97,'50',1,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-01'),(45,'MF8201','厦门航空','空客A330','厦门','上海','厦门高崎机场','上海浦东机场','09:30','12:00',0,850.00,850,850,17,1530,5,2975,3,150,95,'25',1,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-01'),(46,'MF8202','厦门航空','波音787','厦门','上海','厦门高崎机场','上海浦东机场','14:10','16:40',0,920.00,920,920,34,1656,4,3220,4,150,96,'42',1,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-01'),(47,'9C8801','春秋航空','空客A320','上海','广州','上海虹桥机场','广州白云机场','10:00','12:30',0,650.00,650,650,15,1170,2,2275,2,150,90,'19',1,'E:\\qtp\\1\\newimages\\chunqiu.jpg',0,'2025-12-01'),(48,'9C8802','春秋航空','波音737','上海','广州','上海虹桥机场','广州白云机场','15:20','17:50',0,720.00,720,720,34,1296,9,2520,1,150,91,'44',1,'E:\\qtp\\1\\newimages\\chunqiu.jpg',0,'2025-12-01'),(49,'9C8901','春秋航空','空客A321','上海','成都','上海虹桥机场','成都天府机场','08:10','11:40',0,980.00,980,980,49,1764,1,3430,2,210,89,'52',1,'E:\\qtp\\1\\newimages\\chunqiu.jpg',0,'2025-12-01'),(50,'9C8902','春秋航空','波音737','上海','成都','上海虹桥机场','成都天府机场','13:30','17:00',0,1050.00,1050,1050,35,1890,1,3675,1,210,90,'37',1,'E:\\qtp\\1\\newimages\\chunqiu.jpg',0,'2025-12-01'),(51,'HO1201','吉祥航空','空客A320','上海','北京','上海浦东机场','北京首都机场','09:20','11:50',0,880.00,880,880,26,1584,2,3080,2,150,94,'30',1,'E:\\qtp\\1\\newimages\\jixiang.jpg',0,'2025-12-01'),(52,'HO1202','吉祥航空','波音737','上海','北京','上海浦东机场','北京首都机场','14:00','16:30',0,950.00,950,950,28,1710,3,3325,5,150,95,'36',1,'E:\\qtp\\1\\newimages\\jixiang.jpg',0,'2025-12-01'),(53,'HO1301','吉祥航空','空客A330','南京','广州','南京禄口机场','广州白云机场','10:40','13:10',0,920.00,920,920,10,1656,2,3220,3,150,93,'15',1,'E:\\qtp\\1\\newimages\\jixiang.jpg',0,'2025-12-01'),(54,'HO1302','吉祥航空','波音787','南京','广州','南京禄口机场','广州白云机场','15:10','17:40',0,990.00,990,990,31,1782,10,3465,1,150,94,'42',1,'E:\\qtp\\1\\newimages\\jixiang.jpg',0,'2025-12-01'),(55,'CA1901','中国国际航空','波音787','北京','乌鲁木齐','北京首都机场','乌鲁木齐天山机场','22:00','01:30',1,1850.00,1850,1850,13,3330,9,6475,0,210,92,'22',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(56,'MU2901','东方航空','空客A330','上海','昆明','上海浦东机场','昆明长水机场','23:10','02:40',1,1680.00,1680,1680,13,3024,10,5880,3,210,90,'26',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(57,'CZ3901','南方航空','波音777','广州','拉萨','广州白云机场','拉萨贡嘎机场','21:40','00:50',1,2250.00,2250,2250,10,4050,4,7875,4,190,88,'18',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(58,'HU7901','海南航空','空客A350','海口','哈尔滨','海口美兰机场','哈尔滨太平机场','22:30','03:10',1,1980.00,1980,1980,35,3564,10,6930,5,280,91,'50',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(59,'9C8701','春秋航空','空客A320','上海','贵阳','上海虹桥机场','贵阳龙洞堡机场','23:00','02:20',1,1050.00,1050,1050,41,1890,2,3675,2,200,87,'45',0,'E:\\qtp\\1\\newimages\\chunqiu.jpg',0,'2025-12-01'),(60,'CA2001','中国国际航空','空客A321','西安','北京','西安咸阳机场','北京首都机场','07:10','09:40',0,780.00,780,780,29,1404,3,2730,4,150,95,'36',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-02'),(61,'MU2001','东方航空','波音737','武汉','上海','武汉天河机场','上海浦东机场','08:20','11:00',0,650.00,650,650,13,1170,2,2275,3,160,94,'18',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-02'),(62,'CZ2001','南方航空','空客A320','重庆','广州','重庆江北机场','广州白云机场','09:30','12:10',0,820.00,820,820,27,1476,5,2870,5,160,96,'37',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-02'),(63,'ZH2001','深圳航空','波音737','杭州','深圳','杭州萧山机场','深圳宝安机场','10:40','13:20',0,750.00,750,750,13,1350,9,2625,5,160,97,'27',0,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-02'),(64,'MF2001','厦门航空','空客A330','青岛','厦门','青岛胶东机场','厦门高崎机场','11:50','14:30',0,980.00,980,980,41,1764,5,3430,4,160,93,'50',0,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-02'),(65,'HO2001','吉祥航空','波音787','长沙','南京','长沙黄花机场','南京禄口机场','13:00','15:40',0,680.00,680,680,15,1224,7,2380,4,160,92,'26',0,'E:\\qtp\\1\\newimages\\jixiang.jpg',0,'2025-12-02'),(66,'CA2101','中国国际航空','空客A330','郑州','成都','郑州新郑机场','成都天府机场','14:10','16:50',0,850.00,850,850,36,1530,3,2975,0,160,95,'39',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-03'),(67,'MU2101','东方航空','波音777','济南','广州','济南遥墙机场','广州白云机场','15:20','18:00',0,920.00,920,920,44,1656,1,3220,3,160,94,'48',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-03'),(68,'CZ2101','南方航空','空客A350','南宁','深圳','南宁吴圩机场','深圳宝安机场','16:30','19:10',0,1050.00,1050,1050,34,1890,5,3675,1,160,96,'40',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-03'),(69,'HU2101','海南航空','波音787','福州','海口','福州长乐机场','海口美兰机场','17:40','20:20',0,1180.00,1180,1180,46,2124,9,4130,4,160,93,'59',0,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-03'),(70,'CA2201','中国国际航空','空客A320','银川','北京','银川河东机场','北京首都机场','08:00','10:30',0,880.00,880,880,11,1584,10,3080,3,150,94,'24',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(71,'MU2201','东方航空','波音737','西宁','上海','西宁曹家堡机场','上海浦东机场','09:10','11:40',0,1250.00,1250,1250,12,2250,7,4375,5,170,92,'24',0,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(72,'CZ2201','南方航空','空客A321','呼和浩特','广州','呼和浩特白塔机场','广州白云机场','10:20','12:50',0,980.00,980,980,31,1764,1,3430,2,150,95,'34',0,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(73,'ZH2201','深圳航空','波音737','兰州','深圳','兰州中川机场','深圳宝安机场','11:30','14:00',0,1120.00,1120,1120,18,2016,7,3920,4,150,96,'29',0,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-01'),(74,'MF2201','厦门航空','空客A330','大连','厦门','大连周水子机场','厦门高崎机场','12:40','15:10',0,1050.00,1050,1050,13,1890,10,3675,1,150,93,'24',0,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-01'),(75,'CA3001','中国国际航空','波音787','乌鲁木齐','北京','乌鲁木齐天山机场','北京首都机场','22:20','01:50',1,1980.00,1980,1980,42,3564,1,6930,0,210,91,'43',1,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-01'),(76,'MU3001','东方航空','空客A330','昆明','上海','昆明长水机场','上海浦东机场','23:30','03:00',1,1750.00,1750,1750,15,3150,5,6125,3,210,89,'23',1,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-01'),(77,'CZ3001','南方航空','波音777','拉萨','广州','拉萨贡嘎机场','广州白云机场','21:50','01:10',1,2380.00,2380,2380,12,4284,4,8330,3,190,87,'19',1,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-01'),(78,'HU3001','海南航空','空客A350','哈尔滨','海口','哈尔滨太平机场','海口美兰机场','22:40','03:20',1,2050.00,2050,2050,14,3690,6,7175,3,280,90,'23',1,'E:\\qtp\\1\\newimages\\hainan.jpg',0,'2025-12-01'),(79,'9C8801','春秋航空','空客A320','贵阳','上海','贵阳龙洞堡机场','上海虹桥机场','23:10','02:30',1,1120.00,1120,1120,28,2016,4,3920,2,200,86,'34',1,'E:\\qtp\\1\\newimages\\chunqiu.jpg',0,'2025-12-01'),(80,'CA3101','中国国际航空','空客A321','北京','西安','北京首都机场','西安咸阳机场','14:00','16:30',0,850.00,850,850,11,1530,9,2975,1,150,94,'21',1,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-02'),(81,'MU3101','东方航空','波音737','上海','武汉','上海浦东机场','武汉天河机场','15:10','17:50',0,720.00,720,720,46,1296,7,2520,2,160,93,'55',1,'E:\\qtp\\1\\newimages\\eastern.jpg',0,'2025-12-02'),(82,'CZ3101','南方航空','空客A320','广州','重庆','广州白云机场','重庆江北机场','16:20','19:00',0,890.00,890,890,43,1602,3,3115,2,160,95,'48',1,'E:\\qtp\\1\\newimages\\southern.jpg',0,'2025-12-02'),(83,'ZH3101','深圳航空','波音737','深圳','杭州','深圳宝安机场','杭州萧山机场','17:30','20:10',0,820.00,820,820,43,1476,7,2870,5,160,96,'55',1,'E:\\qtp\\1\\newimages\\shenzhen.jpg',0,'2025-12-02'),(84,'MF3101','厦门航空','空客A330','厦门','青岛','厦门高崎机场','青岛胶东机场','18:40','21:20',0,1050.00,1050,1050,29,1890,8,3675,1,160,92,'38',1,'E:\\qtp\\1\\newimages\\xiamen.jpg',0,'2025-12-02'),(85,'HO3101','吉祥航空','波音787','南京','长沙','南京禄口机场','长沙黄花机场','19:50','22:30',0,750.00,750,750,24,1350,9,2625,0,160,91,'33',1,'E:\\qtp\\1\\newimages\\jixiang.jpg',0,'2025-12-02'),(86,'CA1999','中国国际航空','波音787','北京','上海','北京首都机场','上海浦东机场','10:00','13:30',0,1200.00,1200,1200,35,2160,8,4200,2,210,95,'45',0,'E:\\qtp\\1\\newimages\\airchina.jpg',0,'2025-12-10');
/*!40000 ALTER TABLE `flight_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `uesr_info1`
--

DROP TABLE IF EXISTS `uesr_info1`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `uesr_info1` (
  `username` varchar(46) NOT NULL,
  `userpwd` varchar(45) NOT NULL,
  `userid` int(11) NOT NULL AUTO_INCREMENT,
  `phone` varchar(20) NOT NULL,
  `email` varchar(45) DEFAULT NULL,
  `card` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`userid`),
  UNIQUE KEY `phone_UNIQUE` (`phone`),
  UNIQUE KEY `userid_UNIQUE` (`userid`),
  UNIQUE KEY `email_UNIQUE` (`email`),
  UNIQUE KEY `card_UNIQUE` (`card`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `uesr_info1`
--

LOCK TABLES `uesr_info1` WRITE;
/*!40000 ALTER TABLE `uesr_info1` DISABLE KEYS */;
INSERT INTO `uesr_info1` VALUES ('小红','red',1,'12345678','12345678@qq.com','12345678'),('小白','white',2,'13245678901','123456789@qq.com','123456789'),('19338191207','11111111aA!',3,'19338191207',NULL,NULL),('17875904308','1234567890aB@',4,'17875904308',NULL,NULL),('18573841979','12345678aA!',5,'18573841979',NULL,NULL);
/*!40000 ALTER TABLE `uesr_info1` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-12-10 20:30:47
